---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures
source: html/c9cc2403-573b-9327-37fe-3fc4e5eb485d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures

Failures about KeyBasedTreeEntry.

## Syntax (C#)
```csharp
public static class KeyBasedTreeEntryFailures
```